Tasks/ЗадачаСогласованияЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ЗадачаСогласованияЦен</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСогласующего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РешениеПринято</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Tasks/ЗадачаСогласованияЦен/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДанныеФормы();
	НастроитьДоступность();
	УстановитьОформлениеЗакупочнойЦены();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьДанныеФормы();
	НастроитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	
	ЗавершитьЗадачу(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Отказать(Команда)
	
	ЗавершитьЗадачу(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаЦен.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьЦенуНаСервере(ТекущаяСтрока.ТипЦен);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенКоэффициентКаналаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаЦен.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "";
	Если Не ПересчитатьКоэффициентНаСервере(ТекущаяСтрока.ТипЦен, ТекстОшибки) И ЗначениеЗаполнено(ТекстОшибки) Тогда
		Сообщить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗадачу(Согласовано)
	
	ТекстОшибки = "";
	Если Не ЗавершитьЗадачуНаСервере(Согласовано, ТекстОшибки) Тогда
		Сообщить(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы()
	
	БизнесПроцессОбъект = Объект.БизнесПроцесс.ПолучитьОбъект();
	Номенклатура = БизнесПроцессОбъект.Номенклатура;
	ДатаПрименения = БизнесПроцессОбъект.ДатаПрименения;
	НомерСогласующего = Объект.НомерСогласующего;
	Комментарий = Объект.Комментарий;
	ЗаголовокШага = "Согласующий " + НомерСогласующего + " из 3";
	
	ТаблицаЦен.Загрузить(БизнесПроцессОбъект.Цены.Выгрузить());
	СогласованиеЦенНоменклатурыСервер.РассчитатьПроцентыИзменения(ТаблицаЦен);
	Для Каждого СтрокаЦен Из ТаблицаЦен Цикл
		СтрокаЦен.КоэффициентИсходный = СтрокаЦен.КоэффициентКанала;
	КонецЦикла;
	
	ИсторияСогласования.Очистить();
	Для Номер = 1 По НомерСогласующего - 1 Цикл
		
		Если Не БизнесПроцессОбъект["СогласованиеВыполнено" + Номер] Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаИстории = ИсторияСогласования.Добавить();
		СтрокаИстории.Номер = Номер;
		Согласующий = СогласованиеЦенНоменклатурыСервер.ПолучитьСогласующего(Номер);
		СтрокаИстории.Согласующий = ?(Согласующий = Неопределено, "Согласующий " + Номер, Согласующий.Пользователь);
		СтрокаИстории.Результат = ?(БизнесПроцессОбъект["РезультатСогласования" + Номер], "Согласовано", "Отказано");
		СтрокаИстории.Комментарий = БизнесПроцессОбъект["Комментарий" + Номер];
		СтрокаИстории.ДатаРешения = БизнесПроцессОбъект["ДатаРешения" + Номер];
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеЗакупочнойЦены()
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЦен");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаЦен.ТипЦен");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Справочники.ТипыЦенНоменклатуры.Закупочная;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ВажнаяНадписьШрифт);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступность()
	
	ЗадачаВыполнена = Объект.Выполнена;
	ЭтоПоследнийСогласующий = НомерСогласующего = 3 И Не ЗадачаВыполнена;
	
	Элементы.Согласовать.Доступность = Не ЗадачаВыполнена;
	Элементы.Отказать.Доступность = Не ЗадачаВыполнена;
	Элементы.Комментарий.ТолькоПросмотр = ЗадачаВыполнена;
	Элементы.ДатаПрименения.ТолькоПросмотр = Не ЭтоПоследнийСогласующий;
	Элементы.ТаблицаЦен.ТолькоПросмотр = Не ЭтоПоследнийСогласующий;
	
	Если ЭтоПоследнийСогласующий Тогда
		Элементы.ТаблицаЦенЦена.ТолькоПросмотр = Ложь;
		Элементы.ТаблицаЦенКоэффициентКанала.ТолькоПросмотр = Ложь;
		Элементы.ТаблицаЦенТипЦен.ТолькоПросмотр = Истина;
		Элементы.ТаблицаЦенЦенаСтарая.ТолькоПросмотр = Истина;
		Элементы.ТаблицаЦенЦенаСНДС.ТолькоПросмотр = Истина;
		Элементы.ТаблицаЦенПроцентИзменения.ТолькоПросмотр = Истина;
		Элементы.ТаблицаЦенПроцентСкидкиНаценки.ТолькоПросмотр = Истина;
		Элементы.ТаблицаЦенСпособРасчетаЦены.ТолькоПросмотр = Истина;
		Элементы.ТаблицаЦенЕдиницаИзмерения.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦенуНаСервере(ТипЦен)
	
	Таблица = ТаблицаЦен.Выгрузить();
	СогласованиеЦенНоменклатурыСервер.ПересчитатьПослеИзмененияЦены(Таблица, ТипЦен, Номенклатура);
	ТаблицаЦен.Загрузить(Таблица);
	
КонецПроцедуры

&НаСервере
Функция ПересчитатьКоэффициентНаСервере(ТипЦен, ТекстОшибки)
	
	Если СогласованиеЦенНоменклатурыСервер.ЭтоКанал5(ТипЦен) Тогда
		Строки = ТаблицаЦен.НайтиСтроки(Новый Структура("ТипЦен", ТипЦен));
		Если Строки.Количество() > 0 Тогда
			Строки[0].КоэффициентКанала = Строки[0].КоэффициентИсходный;
		КонецЕсли;
		ТекстОшибки = "Для закупочной цены (канал 5) коэффициент не применяется.";
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Таблица = ТаблицаЦен.Выгрузить();
		СогласованиеЦенНоменклатурыСервер.ПересчитатьПослеИзмененияКоэффициента(Таблица, ТипЦен, Номенклатура);
		ТаблицаЦен.Загрузить(Таблица);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ЗавершитьЗадачуНаСервере(Согласовано, ТекстОшибки)
	
	Если Объект.Выполнена Тогда
		ТекстОшибки = "Задача уже выполнена.";
		Возврат Ложь;
	КонецЕсли;
	
	Если НомерСогласующего = 3 И Согласовано Тогда
		Если Не ЗначениеЗаполнено(ДатаПрименения) Или НачалоДня(ДатаПрименения) < НачалоДня(ТекущаяДата()) Тогда
			ТекстОшибки = "Дата применения не может быть меньше текущей даты.";
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		Если НомерСогласующего = 3 Тогда
			БизнесПроцессОбъект = Объект.БизнесПроцесс.ПолучитьОбъект();
			БизнесПроцессОбъект.ДатаПрименения = НачалоДня(ДатаПрименения);
			БизнесПроцессОбъект.Цены.Загрузить(ТаблицаЦен.Выгрузить());
			БизнесПроцессОбъект.Записать();
		КонецЕсли;
		
		ЗадачаОбъект = РеквизитФормыВЗначение("Объект");
		ЗадачаОбъект.Согласовано = Согласовано;
		ЗадачаОбъект.Комментарий = Комментарий;
		ЗадачаОбъект.РешениеПринято = Истина;
		ЗадачаОбъект.Записать();
		ЗадачаОбъект.ВыполнитьЗадачу();
		ЗначениеВРеквизитФормы(ЗадачаОбъект, "Объект");
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
